//Hunt for Conditional Access update events in Azure AD (past 30 days).

// Get all Conditional Access policy update events.
  AuditLogs
  | where TimeGenerated > ago(30d)
  | where OperationName in ("Add conditional access policy", "Update conditional access policy", "Delete conditional access policy")
  | project TimeGenerated, OperationName, policy=TargetResources[0].displayName, modifiedBy=InitiatedBy.user.userPrincipalName, result=Result, oldPolicy=TargetResources[0].modifiedProperties[0].oldValue, newPolicy=TargetResources[0].modifiedProperties[0].newValue
  | order by TimeGenerated
