//Hunt for newly created service principals (past 30 days) created by new user accounts

// Recently created Azure AD service principals created by new user accounts.
  let NewUsers = AuditLogs
      | where OperationName == "Add user"
      | where TimeGenerated > ago(30days)
      | extend UserID = tostring(TargetResources[0].id)
      | project NewUser = TargetResources[0].userPrincipalName, UserID, UserCreated = TimeGenerated;
  let NewServicePrincipals = AuditLogs
      | where OperationName == "Add service principal"
      | where TimeGenerated > ago(30days)
      | project ServicePrincipalDisplayName = TargetResources[0].displayName, ServicePrincipalCreated = TimeGenerated, InitiatedBy = InitiatedBy.user.userPrincipalName;
  NewServicePrincipals
      | extend InitiatedBy = tostring(InitiatedBy)
      | join kind=inner (
          NewUsers
          | extend NewUser = tostring(NewUser)
      ) on $left.InitiatedBy == $right.NewUser
      | project ServicePrincipalDisplayName, ServicePrincipalCreated, InitiatedBy, UserCreated, UserID
      | order by ServicePrincipalCreated
