//Hunt for threat intelligence matches in the Sentinel UEBA table. This will indicate if any IP-address used by a user is associated with a, Microsoft, known threat.

// UEBA threat intelligence alerts like Tor exit nodes, bot net members and other threats.
  BehaviorAnalytics
  | where TimeGenerated > ago(90d)
  | extend ThreatIntelIndicatorDescription = DevicesInsights.ThreatIntelIndicatorDescription
  | where isnotempty( ThreatIntelIndicatorDescription ) 
  | project TimeGenerated, ActivityType, UserPrincipalName, SourceIPAddress, SourceIPLocation, ThreatIntelIndicatorDescription
  | order by TimeGenerated desc
